json/web开源测试工具-siege - 铁狮子
{"title": "web开源测试工具-siege - 铁狮子 ", "index": "golang,python,node.js", "content": "简介\nSiege是一款开源的压力测试工具，设计用于评估WEB应用在压力下的承受能力。可以根据配置对一个WEB站点进行多用户的并发访问，记录每个用户所有请求过程的相应时间，并在一定数量的并发访问下重复进行。siege可以从您选择的预置列表中请求随机的URL。所以siege可用于仿真用户请求负载，而ab则不能。但不要使用siege来执行最高性能基准调校测试，这方面ab就准确很多。\n安装\ncurl http://download.joedog.org/siege/siege-latest.tar.gz\ntar -zxvf siege-latest.tar.gz\ncd siege-2.72/\n./configure\nmake\nmake install\n\nsiege的各个版本\nsiege主页\n\n使用\nsiege -b -c 100 -t 10S http://domain.com/\n参数详解：\n-C,或–config 在屏幕上打印显示出当前的配置,配置是包括在他的配置文件$HOME/.siegerc中,可以编辑里面的参数,这样每次siege 都会按照它运行.\n-v 运行时能看到详细的运行信息\n-c n,或–concurrent=n 模拟有n个用户在同时访问,n不要设得太大,因为越大,siege 消耗本地机器的资源越多\n-i,–internet 随机访问urls.txt中的url列表项,以此模拟真实的访问情况(随机性),当urls.txt存在是有效\n-d n,–delay=n hit每个url之间的延迟,在0-n之间\n-r n,–reps=n 重复运行测试n次,不能与 -t同时存在\n-t n,–time=n 持续运行siege ‘n’秒(如10S),分钟(10M),小时(10H)\n-l 运行结束,将统计数据保存到日志文件中siege .log,一般位于/usr/local/var/siege .log中,也可在.siegerc中自定义\n-R SIEGERC,–rc=SIEGERC 指定用特定的siege 配置文件来运行,默认的为$HOME/.siegerc\n-f FILE, –file=FILE 指定用特定的urls文件运行siege ,默认为urls.txt,位于siege 安装目录下的etc/urls.txt\n-u URL,–url=URL 测试指定的一个URL,对它进行”siege “,此选项会忽略有关urls文件的设\n说明\n\nTransactions:                    1998 hits       //完成多少次处理\nAvailability:                  99.90     //成功率\nElapsed time:                  63.04 secs      //总共用时\nData transferred:              10.98 MB          //总共数据传输 xx.MB\nResponse time:                  3.46 secs     \\显示网络连接的速度\nTransaction rate:              31.69 trans/sec \\平均每秒完成多少次处理：表示服务器后\nThroughput:                     0.17 MB/sec    　　\\平均每秒传传送数据\nConcurrency:                  109.80        　　 \\实际最高并发数\nSuccessful transactions:        1998         　　 \\成功处理次数\nFailed transactions:               2         　　  \\失败处理次数\nLongest transaction:           28.09        　　   //每次传输所花最长时间\nShortest transaction:           0.17         　　 //每次传输所花最短时间\n\n\n                ", "mainLikeNum": ["0 "], "mainBookmarkNum": "7"}